package chap13;

public class E15Ex01 {

			// 1. Stream을 이용해서 구구단 
	

			// 2. 현재 수중에 500,000원을 갖고 있습니다. <보기>에 나오는 항목으로 장을 봤습니다.
			//    수중에 남는 돈은 얼마인지 reduce().메서드를 활용하여 코드 구현
			/* 보기
			 * 
			 * 빵	20,000
			 * 우유	5,000
			 * 라면 10,000
			 * 옷 200,000
			 * 신발 100,000
			 * 삼겹살 50,000
			 * 소주 10,000
			 * 삼장 2,000
			 * 상추 3,500
			 * 쌀 50,000
			 * ----
			 * 남은 돈 : 49,500
			 * 
			 */
			
			// 3. 1에서 100까지의 수 중에서 소수만 골라서 총 몇 개의 요소가 있는지 Stream을 이용하여 구현
			
			// 4. 파일명들에 확장자가 누락되어 있습니다. 파일명 뒤에'.java'를 모두 붙여서 출력하는 코드 구현
			//   보기> Sample01, Sample02,..
			//			[ Sample01.java, Sample02.java,...]
			
			// 5. 로또 번호를 스트림을 이용하여 난수를 발생시켜서 출력
			/*
			 * 조건 
			 * - 중복 값이 있으면 안된다.
			 * - 1부터 45까지의 수만 올 수 있다.
			 * - 순차적으로 정렬
			 * 
			 *  > 결과 : 2 4 5 22 24 48
			 */
}
